Repository: Robson10/RSync
Catalog: RSync.AppResources/Localization/res.*.resx
Languages: pl_pl

# btnAbort
source: Abort
pl_pl: Anuluj

# btnAdd
source: Add
pl_pl: Dodaj

# btnEdit
source: Edit
pl_pl: Edytuj

# btnRemove
source: Remove
pl_pl: Usuń

# btnSave
source: Save
pl_pl: Zapisz

# btnSignIn
source: Sign in
pl_pl: Zaloguj

# btnSuspend
source: Suspend
pl_pl: Zawieś

# btnTestConnection
source: Test connection
pl_pl: Testuj połączenie

# capError
source: Error
pl_pl: Błąd

# colCustomName
source: Custom name
pl_pl: Nazwa

# colServerName
source: Server
pl_pl: Serwer

# colSuspended
source: Suspended
pl_pl: Zawieszone

# EnumAppLanguageEnglish
source: English
pl_pl: Angielski

# EnumAppLanguagePolish
source: Polish
pl_pl: Polski

# ErrorFieldIsEmpty
source: Field cannot be empty.
pl_pl: Pole nie może być puste.

# exArgumentNullException
source: An unexpected error has occurred. The application will close.
pl_pl: Wystąpił nieoczekiwany błąd. Aplikacja zostanie zamknięta.

# exDataContextTypeException
source: A fatal error has occurred. The application will be closed. Expected data context of type {0} for object {1}
pl_pl: Wystąpił błąd krytyczny. Aplikacja zostanie zamknięta. Oczekiwano kontekst danych typu {0} dla obiektu {1}

# exJSonArgumentNullException
source: An attempt was made to serialize the null object.
pl_pl: Nastąpiła próba serializacji obiektu o wartości null.

# exLogNullException
source: Connot log null value of exception.
pl_pl: Nie można zalogować błędu o wartości null.

# exNotImplementedException
source: Functionality is currently not available.
pl_pl: Funkcjonalność obecnie nie jest dostępna.

# exPropertyNullException
source: Property {0} is null or empty.
pl_pl: Pole {0} jest puste.

# exRsaPrivateKeyIsNull
source: RSA private key used to decrypt is empty.
pl_pl: Prywatny klucz RSA użyty do deszyfrowania jest pusty.

# lblAppLanguage
source: App language
pl_pl: Język aplikacji

# lblCustomName
source: Custom Name :
pl_pl: Nazwa wyświetlana :

# lblPassword
source: Password :
pl_pl: Hasło :

# lblServer
source: Server :
pl_pl: Serwer :

# msgCannotCreateNewUser
source: Unable to create user. Make a backup copy of the {0} file and then delete it to create the user. If the user loses the above file, he will lose access to most of the data.
pl_pl: Nie można utworzyć użytkownika. Zrób kopię bezpieczeństwa pliku {0}, a nstępnie go usuń w celu utworzenia użytkownika. W przypadku gdy użytkownik utraci powyższy plik utraci on dostęp do większości danych.

# msgCannotDeserializePrivateRsaKey
source: The private key saved in the {0} file has errors. The reason may be manual modification of the file. Try to fix it or generate a new key. Generating a new key will prevent the encrypted data from being restored. Do you want to generate a new key?
pl_pl: Klucz prywatny zapisany w pliku {0}, posiada błędy. Przyczyną może być ręczna modyfikacja pliku. Spróbuj go naprawić lub wygeneruj nowy klucz. Wygenerowanie nowego klucza uniemożliwi odtworzenie zaszyfrowanych danych. Czy chcesz wygenerować nowy klucz?

# msgCannotDeserializePublicRsaKey
source: The private key has errors. Contact with administrator or generate a new key. Generating a new key will prevent the encrypted data from being restored. Do you want to generate a new key?
pl_pl: Klucz publiczny posiada błędy. Skontaktuj się z administratorem lub wygeneruj nowy klucz. Wygenerowanie nowego klucza uniemożliwi odtworzenie zaszyfrowanych danych. Czy chcesz wygenerować nowy klucz?

# msgEmptyCustomName
source: Custom name cannot be empty.
pl_pl: Pole Nazwa Wyświetlana nie może być puste.

# msgEmptyLogin
source: Login cannot be empty.
pl_pl: Pole Login jest puste.

# msgEmptyPassword
source: Password cannot be empty.
pl_pl: Pole Hasło jest puste.

# msgLoginInUse
source: Login already in use.
pl_pl: Login jest zajęty.

# msgPrivateRsaNotFound
source: The private key to encrypt data was not found ({0}). If you log in to a new location, you should move the file from the previous device. If you do not have a copy of the file, you will need to generate a new set of keys which will result in the loss of access to data on this and other devices. Continue?
pl_pl: Klucz prywatny do szyfrowania danych nie został znaleziony ({0}). Jeśli logujesz się w nowym miejscu powinieneś przenieść plik z poprzedniego urządzenia. Jeżeli nie posiadasz kopii pliku, niezbędne będzie wygenerowanie nowego zestawu kluczy co wiąże się z utratą dostępu do danych na tym i innych urządzeniach. Kontynuować?

# msgPublicRsaNotFound
source: The public key for data encryption was not found. It will be necessary to generate a new set of keys which will result in the loss of access to data. Continue?
pl_pl: Klucz publiczny do szyfrowania danych nie został znaleziony. Niezbędne będzie wygenerowanie nowego zestawu kluczy co wiąże się z utratą dostępu do danych. Kontynuować?

# msgRsaKeysNotMatch
source: The encryption and decryption keys do not match. Try to fix them or generate a new key set. Generating new keys will prevent encrypted data from being restored. Do you want to generate a new key set?
pl_pl: Klucze do szyfrowania i odszyfrowywania danych są niezgodne. Spróbuj je naprawić lub wygeneruj nowy zestaw kluczy. Wygenerowanie nowych kluczy uniemożliwi odtworzenie zaszyfrowanych danych. Czy chcesz wygenerować nowy zestaw kluczy?

# msgServerExist
source: Server with this login has already added.
pl_pl: Server z tym loginem już istnieje.

# msgSettingsRequireRestartApplication
source: New settings require restart the application. Do you want to restart the application?
pl_pl: Nowe ustawienia wymagają ponownego uruchomienia aplikacji w celu wprowadzenia zmian. Czy chcesz ponownie uruchomic aplikację?

# msgTestConnectionConnected
source: Test completed successfully.
pl_pl: Test zakończono pomyślnie.

# msgWrongCredentials
source: Wrong login or password.
pl_pl: Błędny login lub hasło.

# testText
source: Example text.
pl_pl: Przykładowy tekst.

# ttAbout
source: About.
pl_pl: O aplikacji.

# ttAddFile
source: Add File.
pl_pl: Dodaj plik.

# ttAddFolder
source: Add Folder.
pl_pl: Dodaj folder.

# ttHideAllSelectedElements
source: Hide all selected files and folders.
pl_pl: Ukrywa wszystkie zanzaczone pliki i foldery.

# ttOptions
source: Options.
pl_pl: Opcje.

# ttRefresh
source: Refresh.
pl_pl: Odśwież.

# ttServers
source: Pinned servers.
pl_pl: Podłączone serwery.

# ttShowAllHiddenElements
source: Show all hidden files and folders
pl_pl: Pokaż wszystkie ukryte pliki i foldery.

# ttSignIn
source: Sign in.
pl_pl: Zaloguj.

# ttStart
source: Resume application working.
pl_pl: Wznów działanie aplikacji.

# ttStop
source: Stop application working.
pl_pl: Zatrzymaj działanie aplikacji.

# ttSynchronizationStatus
source: Synchronization status.
pl_pl: Status synchronizacji.

# WindowTitleAddAccount
source: Add account
pl_pl: Dodaj konto

# WindowTitleAddServer
source: Add server
pl_pl: Dodaj serwer

# WindowTitleServers
source: Server list
pl_pl: Lista serwerów

# WindowTitleSettings
source: Settings
pl_pl: Ustawienia aplikacji

# WindowTitleSignIn
source: Sign in
pl_pl: Logowanie
